In [4]:
import pandas as pd

In [5]:
account_df = pd.read_csv("../Resources/data-account_ownership.csv") 
capita_df = pd.read_csv("../Resources/data-per_capita_income.csv")

In [9]:
account_df

           country_name    2011_AO    2014_AO    2017_AO
0           Afghanistan   9.005013   9.961000  14.893312
1               Albania  28.268126  37.986355  40.015171
2               Algeria  33.286114  50.475788  42.776627
3            Arab World  22.260538  30.277130  37.165211
4             Argentina  33.130219  50.197296  48.708488
..                  ...        ...        ...        ...
249       Venezuela, RB  44.116661  57.026325  73.494507
250             Vietnam  21.369493  30.950945  30.795792
251  West Bank and Gaza  19.428032  24.243807  25.022177
252              Zambia  21.364910  35.644871  45.863258
253            Zimbabwe  39.651211  32.389252  55.285137

[254 rows x 4 columns]

In [10]:
capita_df

    country_name  2011_pci  2014_pci  2017_pci
0    Afghanistan       519       532       488
1        Albania      3667      3775      3673
2        Algeria      3960      4106      3248
3         Angola      1500      2398      1756
4     Arab World      5389      6041      5153
..           ...       ...       ...       ...
179      Vietnam      1254      1693      1937
180        World      8507      8967      8865
181  Yemen, Rep.      1027      1418       842
182       Zambia      1140      1321      1104
183     Zimbabwe       793      1134      1233

[184 rows x 4 columns]

In [11]:
account_df.merge(capita_df)

,country_name,2011_AO,2014_AO,2017_AO,2011_pci,2014_pci,2017_pci
0,Afghanistan,9.005013,9.961000,14.893312,519,532,488
1,Afghanistan,9.005013,9.961000,14.893312,519,532,488
2,Albania,28.268126,37.986355,40.015171,3667,3775,3673
3,Albania,28.268126,37.986355,40.015171,3667,3775,3673
4,Algeria,33.286114,50.475788,42.776627,3960,4106,3248
...,...,...,...,...,...,...,...
237,Vietnam,21.369493,30.950945,30.795792,1254,1693,1937
238,Zambia,21.364910,35.644871,45.863258,1140,1321,1104
239,Zambia,21.364910,35.644871,45.863258,1140,1321,1104
240,Zimbabwe,39.651211,32.389252,55.285137,793,1134,1233
241,Zimbabwe,39.651211,32.389252,55.285137,793,1134,1233